#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.external.rabbit_01_psp_token_otp: Reading...
random_password.alicloud_password: Refreshing state... [id=none]
random_password.webserver_password: Refreshing state... [id=none]
random_password.rtmp_password: Refreshing state... [id=none]
random_password.alicloud3_password: Refreshing state... [id=none]
tls_private_key.alicloud_key: Refreshing state... [id=2715b21a5b35894000d79cf7965b18307e9258b3]
tls_private_key.webserver_key: Refreshing state... [id=81d28d3c476734c1aaf4c71b34dcb2860024d06e]
tls_private_key.alicloud3_key: Refreshing state... [id=f63af23191753064cf32785a897bf9b0e4143c8a]
tls_private_key.rtmp_key: Refreshing state... [id=dd53b14179e8a4c84f7cad1fa6972b0b89075bec]
data.onepassword_item.rabbit_01_psp_token: Reading...
data.onepassword_item.rabbit_01_psp_token: Read complete after 0s [id=vaults/66qfxcmgwlhutunx6slav6fyve/items/h7fhsftvpum7r4b3rnqznz4lym]
local_file.rtmp_key_file: Refreshing state... [id=34994146c8d028ca24774dd81d754c8a915cab89]
data.external.rabbit_01_psp_token_otp: Read complete after 0s [id=-]
local_file.alicloud_key_file: Refreshing state... [id=e71958442d331fe590a11c211113b6bc0c601a0f]
local_file.alicloud3_key_file: Refreshing state... [id=9cb4b53c3420c0fc6eb951fe0ec7cbe716a41334]
local_file.webserver_key_file: Refreshing state... [id=75b14ce05c6a838c5d7461fdb112b503bb8e9dc6]
proxmox_virtual_environment_file.alilinux_cloud_image: Refreshing state... [id=local:iso/aliyun_2_1903_x64_20G_nocloud_alibase_20220525.img]
proxmox_virtual_environment_file.cloud_config: Refreshing state... [id=local:snippets/ubuntu.cloud-config.yaml]
proxmox_virtual_environment_file.debian_cloud_image: Refreshing state... [id=local:iso/debian-11-genericcloud-amd64.img]
proxmox_virtual_environment_file.cloud_config_alicloud3: Refreshing state... [id=local:snippets/alicloud3.cloud-config.yaml]
proxmox_virtual_environment_file.alilinux3_cloud_image: Refreshing state... [id=local:iso/aliyun_3_x64_20G_nocloud_alibase_20220907.img]
proxmox_virtual_environment_file.cloud_config_rtmp: Refreshing state... [id=local:snippets/ubuntu-rtmp.cloud-config.yaml]
proxmox_virtual_environment_file.cloud_config_alicloud: Refreshing state... [id=local:snippets/alicloud.cloud-config.yaml]
proxmox_virtual_environment_file.ubuntu2204_cloud_image: Refreshing state... [id=local:iso/jammy-server-cloudimg-amd64.img]
proxmox_virtual_environment_file.ubuntu2004_cloud_image: Refreshing state... [id=local:iso/focal-server-cloudimg-amd64.img]
proxmox_virtual_environment_vm.webserver[0]: Refreshing state... [id=501]
proxmox_virtual_environment_vm.alicloud3[0]: Refreshing state... [id=801]
proxmox_virtual_environment_vm.rtmp[0]: Refreshing state... [id=601]
proxmox_virtual_environment_vm.alicloud[0]: Refreshing state... [id=701]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # local_file.alicloud3_key_file will be created
  + resource "local_file" "alicloud3_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./alicloud3-ssh.key"
      + id                   = (known after apply)
    }

  # local_file.alicloud_key_file will be created
  + resource "local_file" "alicloud_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./alicloud-ssh.key"
      + id                   = (known after apply)
    }

  # local_file.rtmp_key_file will be created
  + resource "local_file" "rtmp_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./rtmp-ssh.key"
      + id                   = (known after apply)
    }

  # local_file.webserver_key_file will be created
  + resource "local_file" "webserver_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./webserver-ssh.key"
      + id                   = (known after apply)
    }

  # proxmox_virtual_environment_file.cloud_config_alicloud must be replaced
-/+ resource "proxmox_virtual_environment_file" "cloud_config_alicloud" {
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "local:snippets/alicloud.cloud-config.yaml" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = <<-EOT # forces replacement
                #cloud-config
                #vim:syntax=yaml
                
                packages:
                  - qemu-guest-agent
              - # Create an account named alinux who is authorized to run sudo commands. 
              + # Create an account named alinux who is authorized to run sudo commands.
                users:
                  - default
                  - name: alinux
                    sudo: ['ALL=(ALL)   ALL']
                    plain_text_passwd: aliyun
                    lock_passwd: false
                    ssh-authorized-keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDXyVQZ+0/WfQNNENTRQwP5BsKklUXDyBkgNexGhvSt/5o5mmsbC7A/40w2tjZw0hVvoY3P+OK2FHnpMJX3cjEpDvnHgL5GfnbOtGaf3LrR9IDufPIdZecY66zAoCyfhnoG7Cr8el9crKWpWkWstfISq7MfJOTI/rYxEovl5rdomdlehDNZ2FgtZaQl/ncc9o6jDxWi5/cJzEHAwMG+iTU3koC8V8FOw6ePasTUv+r2AK3/wasj+uwISk2im7wJb8UFoGr8P/l2mUFkzka94gt9lFzFesVOb7fZ+FJTHfUNZ0yHWrDRJUp2tUFlezpD4731osUSChkqjVkSEumFJD8R
                
              - # Create a YUM repository for Alibaba Cloud Linux 2. 
              + # Create a YUM repository for Alibaba Cloud Linux 2.
                yum_repos:
                    base:
                        baseurl: https://mirrors.aliyun.com/alinux/$releasever/os/$basearch/
                        enabled: true
                        gpgcheck: true
                        gpgkey: https://mirrors.aliyun.com/alinux/RPM-GPG-KEY-ALIYUN
                        name: Aliyun Linux - $releasever - Base - mirrors.aliyun.com
                    updates:
                        baseurl: https://mirrors.aliyun.com/alinux/$releasever/updates/$basearch/
                        enabled: true
                        gpgcheck: true
                        gpgkey: https://mirrors.aliyun.com/alinux/RPM-GPG-KEY-ALIYUN
                        name: Aliyun Linux - $releasever - Updates - mirrors.aliyun.com
                    extras:
                        baseurl: https://mirrors.aliyun.com/alinux/$releasever/extras/$basearch/
                        enabled: true
                        gpgcheck: true
                        gpgkey: https://mirrors.aliyun.com/alinux/RPM-GPG-KEY-ALIYUN
                        name: Aliyun Linux - $releasever - Extras - mirrors.aliyun.com
                    plus:
                        baseurl: https://mirrors.aliyun.com/alinux/$releasever/plus/$basearch/
                        enabled: true
                        gpgcheck: true
                        gpgkey: https://mirrors.aliyun.com/alinux/RPM-GPG-KEY-ALIYUN
                        name: Aliyun Linux - $releasever - Plus - mirrors.aliyun.com
                runcmd:
                  #- systemctl start qemu-guest-agent
                  - yum install qemu-guest-agent -y && systemctl start qemu-guest-agent
            EOT
            # (2 unchanged attributes hidden)
        }
    }

  # proxmox_virtual_environment_file.cloud_config_alicloud3 must be replaced
-/+ resource "proxmox_virtual_environment_file" "cloud_config_alicloud3" {
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "local:snippets/alicloud3.cloud-config.yaml" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = <<-EOT # forces replacement
                #cloud-config
                #vim:syntax=yaml
                
                packages:
                  - qemu-guest-agent
              - # Create an account named alinux who is authorized to run sudo commands. 
              + # Create an account named alinux who is authorized to run sudo commands.
                users:
                  - default
                  - name: alinux
                    sudo: ['ALL=(ALL)   ALL']
                    plain_text_passwd: aliyun
                    lock_passwd: false
                    ssh-authorized-keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC1Pjk1rQmjCP7aG2wAzEEUxaYzZk5FfapMk607m4GVUZQbAavMYuZiJcDRJSHr+vsHO+wuCpuprcs8BTu2EGJ5j7CCsirwPg/17LggNk5RscvlK4ZjZrQTUQN5X1zEqozammn7Z9QFTAkEpgTPcvwZvI4Kq33H4hTrVXbM1k3Q+HkYnOnz9+J1uwB9yI0Tgm+Y46d9COeb5N2qfqtnpn4tUCtlqtCa8wHUrZy1dbOc7hr3Aqe26eKaMtYEoSsHkRp/i3YU3AG0RuwMLG+22OUeYW/TaKJ2YjYCBXpoLbXvytoh/9YWJfmSh3SKzMmzwky7b+mCZYrayCQNfBYt2hPL
                
              - # Create a YUM repository for Alibaba Cloud Linux 3. 
              + # Create a YUM repository for Alibaba Cloud Linux 3.
                yum_repos:
                    alinux3-module:
                        name: alinux3-module
                        baseurl: https://mirrors.aliyun.com/alinux/$releasever/module/$basearch/
                        enabled: 1
                        gpgcheck: 1
                        gpgkey: https://mirrors.aliyun.com/alinux/$releasever/RPM-GPG-KEY-ALINUX-3
                    alinux3-updates:
                        name: alinux3-updates
                        baseurl: https://mirrors.aliyun.com/alinux/$releasever/updates/$basearch/
                        enabled: 1
                        gpgcheck: 1
                        gpgkey: https://mirrors.aliyun.com/alinux/$releasever/RPM-GPG-KEY-ALINUX-3
                    alinux3-plus:
                        name: alinux3-plus
                        baseurl: https://mirrors.aliyun.com/alinux/$releasever/plus/$basearch/
                        enabled: 1
                        gpgcheck: 1
                        gpgkey: https://mirrors.aliyun.com/alinux/$releasever/RPM-GPG-KEY-ALINUX-3
                    alinux3-powertools:
                        name: alinux3-powertools
                        baseurl: https://mirrors.aliyun.com/alinux/$releasever/powertools/$basearch/
                        gpgcheck: 1
                        enabled: 1
                        gpgkey: https://mirrors.aliyun.com/alinux/$releasever/RPM-GPG-KEY-ALINUX-3
                    alinux3-os:
                        name: alinux3-os
                        baseurl: https://mirrors.aliyun.com/alinux/$releasever/os/$basearch/
                        gpgcheck: 1
                        enabled: 1
                        gpgkey: https://mirrors.aliyun.com/alinux/$releasever/RPM-GPG-KEY-ALINUX-3
            EOT
            # (2 unchanged attributes hidden)
        }
    }

  # proxmox_virtual_environment_file.ubuntu2204_cloud_image must be replaced
-/+ resource "proxmox_virtual_environment_file" "ubuntu2204_cloud_image" {
      ~ file_modification_date = "2023-03-30T02:43:01Z" -> (known after apply)
      ~ file_name              = "jammy-server-cloudimg-amd64.img" -> (known after apply)
      ~ file_size              = 684785664 -> (known after apply)
      ~ file_tag               = "28d10000-5f8150d147740" -> (known after apply)
      ~ id                     = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ source_file {
          ~ changed   = true -> false # forces replacement
            # (3 unchanged attributes hidden)
        }
    }

  # proxmox_virtual_environment_vm.alicloud[0] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "alicloud" {
      ~ id                      = "701" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "CE:28:43:3A:4C:7C",
        ] -> (known after apply)
        name                    = "alicloud1.ddlns.net"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
      ~ tags                    = [
          - "alicloud1",
            "automation",
            "ubuntu",
          + "alicloud1",
        ]
        # (16 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (6 unchanged attributes hidden)
        }

      ~ initialization {
          ~ user_data_file_id = "local:snippets/alicloud.cloud-config.yaml" # forces replacement -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ user_account {
              ~ password = (sensitive value)
                # (2 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - mac_address = "CE:28:43:3A:4C:7C" -> null
            # (6 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.alicloud3[0] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "alicloud3" {
      ~ id                      = "801" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "42:12:DC:32:E9:0D",
        ] -> (known after apply)
        name                    = "alicloud31.ddlns.net"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
      ~ tags                    = [
          - "alicloud31",
            "automation",
            "ubuntu",
          + "alicloud31",
        ]
        # (16 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (6 unchanged attributes hidden)
        }

      ~ initialization {
          ~ user_data_file_id = "local:snippets/alicloud3.cloud-config.yaml" # forces replacement -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ user_account {
              ~ password = (sensitive value)
                # (2 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - mac_address = "42:12:DC:32:E9:0D" -> null
            # (6 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.rtmp[0] will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "rtmp" {
        id                      = "601"
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "10.10.20.20",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::60f1:59ff:fe86:4ecc",
            ],
        ] -> (known after apply)
        name                    = "rtmp1.ddlns.net"
      ~ network_interface_names = [
          - "lo",
          - "eth0",
        ] -> (known after apply)
      ~ tags                    = [
            "automation",
          - "rtmp1",
            "ubuntu",
          + "rtmp1",
        ]
        # (18 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.webserver[0] will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "webserver" {
        id                      = "501"
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "10.10.20.129",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::d823:cff:fec5:9eb5",
            ],
        ] -> (known after apply)
        name                    = "web1.ddlns.net"
      ~ network_interface_names = [
          - "lo",
          - "eth0",
        ] -> (known after apply)
        tags                    = [
            "automation",
            "ubuntu",
            "web1",
        ]
        # (18 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.webserver[1] will be created
  + resource "proxmox_virtual_environment_vm" "webserver" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Web2 Server"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + name                    = "web2.ddlns.net"
      + network_interface_names = (known after apply)
      + node_name               = "rabbit-01-psp"
      + on_boot                 = true
      + reboot                  = false
      + started                 = true
      + tablet_device           = true
      + tags                    = [
          + "automation",
          + "ubuntu",
          + "web2",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 502

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 4
          + hotplugged   = 0
          + sockets      = 1
          + type         = "qemu64"
          + units        = 1024
        }

      + disk {
          + datastore_id = "data-ssd"
          + file_format  = "qcow2"
          + file_id      = "local:iso/jammy-server-cloudimg-amd64.img"
          + interface    = "virtio0"
          + iothread     = true
          + size         = 10
          + ssd          = false
        }
      + disk {
          + datastore_id = "data-ssd"
          + file_format  = "qcow2"
          + interface    = "virtio1"
          + iothread     = true
          + size         = 30
          + ssd          = false
        }

      + initialization {
          + datastore_id      = "data-ssd"
          + user_data_file_id = "local:snippets/ubuntu.cloud-config.yaml"

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }

          + user_account {
              + keys     = [
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDs7cUrDeSpk6gIsqD2gJUFu/fzvqi3a3Ymv3ICqz26k7uhPuV0acp2dl914lRUjw05fpW2MOPVSlQ21kCLCUzCtD+TvG62DbhPg15Zl0xWKmI9vih+zyxDIqh1dRljv8zOBgD2HOcLXT3N5KsqLRVXb2bS/85KRDq4PFxqdLGH4PtAr/tG9q/92Hi8USDS6qAj7OYspDgsel3qknMxBI/DPU7TZfFQjjWJRRem992M3s1JVh3Dww0HIXD6P8hozmAV1Bn4ZdXFYbG8S9fGlWnvRLfh7SLbSxBFBWHoGJkIC5DFZbEeji/8sPBp+n6+a9PgXfugyGKia/AjqyD5Mea9",
                ]
              + password = (sensitive value)
              + username = "ubuntu"
            }
        }

      + memory {
          + dedicated = 4096
          + floating  = 0
          + shared    = 0
        }

      + network_device {
          + bridge     = "vmbr1"
          + enabled    = true
          + model      = "virtio"
          + mtu        = 0
          + rate_limit = 0
          + vlan_id    = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }
    }

Plan: 10 to add, 2 to change, 5 to destroy.

Changes to Outputs:
  ~ alicloud3_image_id    = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
  ~ alicloud_image_id     = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
  ~ rtmp_image_id         = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
  ~ rtmp_ip               = [
      - "10.10.20.20",
    ] -> (known after apply)
  ~ webserver_image_id    = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
  ~ webserver_ip          = [
      - "10.10.20.129",
    ] -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dark-vex, Action: `pull_request`, Working Directory: ``, Workflow: `TF Plan on a PR (PSP)`*